### The scenario

You are a data analyst for your state’s department of education. You're given a database containing 2 tables: **naep** and **finance**. NAEP is the National Assessment of Educational Progress for states. The naep table contains each state’s average NAEP scores in math and reading for students in grades 4 and 8 for various years between 1992 and 2017. The finance table contains each state’s total K-12 education revenue and expenditures for the years 1992 through 2016.

### Database Connection

Host: 142.93.121.174

Username: dsbc_student

Password: 7*.8G9QH21

Port: 5432

For this exam, you'll need to use the department_of_education database.

In [1]:
#import necessary packages...
import pandas as pd
from sqlalchemy import create_engine

In [2]:
#connect to the database...

postgres_user = 'dsbc_student'
postgres_pw = '7*.8G9QH21'
postgres_host = '142.93.121.174'
postgres_port = '5432'
postgres_db = 'department_of_education'


# use the credentials to start a connection
engine = create_engine('postgresql://{}:{}@{}:{}/{}'.format(
    postgres_user, postgres_pw, postgres_host, postgres_port, postgres_db))

In [3]:
#explore naep...
naep = pd.read_sql_table('naep', engine)

In [4]:
naep.head()

,avg_math_4_score,avg_math_8_score,avg_reading_4_score,avg_reading_8_score,id,state,year
0,232.171,268.312,216.420,257.687,2017_ALABAMA,ALABAMA,2017
1,230.456,277.016,207.038,257.668,2017_ALASKA,ALASKA,2017
2,234.436,282.248,215.466,262.957,2017_ARIZONA,ARIZONA,2017
3,233.848,273.760,216.108,259.956,2017_ARKANSAS,ARKANSAS,2017
4,232.263,276.638,215.422,262.521,2017_CALIFORNIA,CALIFORNIA,2017

In [5]:
naep.columns

Index(['avg_math_4_score', 'avg_math_8_score', 'avg_reading_4_score',
       'avg_reading_8_score', 'id', 'state', 'year'],
      dtype='object')

In [6]:
naep.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 561 entries, 0 to 560
Data columns (total 7 columns):
avg_math_4_score       535 non-null float64
avg_math_8_score       531 non-null float64
avg_reading_4_score    532 non-null float64
avg_reading_8_score    497 non-null float64
id                     561 non-null object
state                  561 non-null object
year                   561 non-null int64
dtypes: float64(4), int64(1), object(2)
memory usage: 30.8+ KB

In [7]:
#explore finance...
finance = pd.read_sql_table('finance', engine)

In [8]:
finance.head()

,capital_outlay_expenditure,enroll,federal_revenue,id,instruction_expenditure,local_revenue,other_expenditure,state,state_revenue,support_services_expenditure,total_expenditure,total_revenue,year
0,174053,NaN,304177,1992_ALABAMA,1481703,715680,NaN,ALABAMA,1659028,735036,2653798,2678885,1992
1,37451,NaN,106780,1992_ALASKA,498362,222100,NaN,ALASKA,720711,350902,972488,1049591,1992
2,609114,NaN,297888,1992_ARIZONA,1435908,1590376,NaN,ARIZONA,1369815,1007732,3401580,3258079,1992
3,145212,NaN,178571,1992_ARKANSAS,964323,574603,NaN,ARKANSAS,958785,483488,1743022,1711959,1992
4,2044688,NaN,2072470,1992_CALIFORNIA,14358922,7641041,NaN,CALIFORNIA,16546514,8520926,27138832,26260025,1992

In [9]:
finance.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1275 entries, 0 to 1274
Data columns (total 13 columns):
capital_outlay_expenditure      1275 non-null int64
enroll                          1224 non-null float64
federal_revenue                 1275 non-null int64
id                              1275 non-null object
instruction_expenditure         1275 non-null int64
local_revenue                   1275 non-null int64
other_expenditure               1224 non-null float64
state                           1275 non-null object
state_revenue                   1275 non-null int64
support_services_expenditure    1275 non-null int64
total_expenditure               1275 non-null int64
total_revenue                   1275 non-null int64
year                            1275 non-null int64
dtypes: float64(2), int64(9), object(2)
memory usage: 129.6+ KB

### Data exploration

##### Question 1

Write a query that allows you to inspect the schema of the naep table.

In [10]:
sql = '''
SELECT * 
FROM INFORMATION_SCHEMA.COLUMNS 
WHERE TABLE_NAME='naep';
'''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

('department_of_education', 'public', 'naep', 'avg_math_4_score', 1, None, 'YES', 'numeric', None, None, None, 10, None, None, None, None, None, None, None, None, None, None, None, None, None, 'department_of_education', 'pg_catalog', 'numeric', None, None, None, None, '1', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES')
('department_of_education', 'public', 'naep', 'avg_math_8_score', 2, None, 'YES', 'numeric', None, None, None, 10, None, None, None, None, None, None, None, None, None, None, None, None, None, 'department_of_education', 'pg_catalog', 'numeric', None, None, None, None, '2', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES')
('department_of_education', 'public', 'naep', 'avg_reading_4_score', 3, None, 'YES', 'numeric', None, None, None, 10, None, None, None, None, None, None, None, None, None, None, None, None, None, 'department_of_education', 'pg_catalog', 'numeric', None, None, None, None, '3', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES')
('department_of_education', 'public', 'naep', 'avg_reading_8_score', 4, None, 'YES', 'numeric', None, None, None, 10, None, None, None, None, None, None, None, None, None, None, None, None, None, 'department_of_education', 'pg_catalog', 'numeric', None, None, None, None, '4', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES')
('department_of_education', 'public', 'naep', 'id', 5, None, 'YES', 'character varying', None, 1073741824, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, 'department_of_education', 'pg_catalog', 'varchar', None, None, None, None, '5', 'NO', 'NO', None, None, None, None, None, 'NO', 'NEVER', None, 'YES')

##### Question 2

Write a query that returns the first 50 records of the naep table.

In [11]:
sql = '''
SELECT *
FROM naep
LIMIT 50;
'''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows:
  print(row)

(Decimal('232.171'), Decimal('268.312'), Decimal('216.42'), Decimal('257.687'), '2017_ALABAMA', 'ALABAMA', 2017)
(Decimal('230.456'), Decimal('277.016'), Decimal('207.038'), Decimal('257.668'), '2017_ALASKA', 'ALASKA', 2017)
(Decimal('234.436'), Decimal('282.248'), Decimal('215.466'), Decimal('262.957'), '2017_ARIZONA', 'ARIZONA', 2017)
(Decimal('233.848'), Decimal('273.76'), Decimal('216.108'), Decimal('259.956'), '2017_ARKANSAS', 'ARKANSAS', 2017)
(Decimal('232.263'), Decimal('276.638'), Decimal('215.422'), Decimal('262.521'), '2017_CALIFORNIA', 'CALIFORNIA', 2017)
(Decimal('240.695'), Decimal('286.248'), Decimal('224.692'), Decimal('270.339'), '2017_COLORADO', 'COLORADO', 2017)
(Decimal('239.238'), Decimal('284.144'), Decimal('228.355'), Decimal('272.538'), '2017_CONNECTICUT', 'CONNECTICUT', 2017)
(Decimal('236.128'), Decimal('278.023'), Decimal('221.482'), Decimal('263.089'), '2017_DELAWARE', 'DELAWARE', 2017)
(Decimal('231.32'), Decimal('265.78'), Decimal('213.382'), Decimal('246.788'), '2017_DISTRICT_OF_COLUMBIA', 'DISTRICT_OF_COLUMBIA', 2017)
(Decimal('246.368'), Decimal('279.12'), Decimal('228.273'), Decimal('280.499'), '2017_FLORIDA', 'FLORIDA', 2017)
(Decimal('236.384'), Decimal('281.035'), Decimal('219.683'), Decimal('266.553'), '2017_GEORGIA', 'GEORGIA', 2017)
(Decimal('237.92'), Decimal('277.337'), Decimal('216.365'), Decimal('266.33'), '2017_HAWAII', 'HAWAII', 2017)
(Decimal('239.968'), Decimal('284.372'), Decimal('222.791'), Decimal('260.982'), '2017_IDAHO', 'IDAHO', 2017)
(Decimal('238.119'), Decimal('281.618'), Decimal('220.366'), Decimal('269.673'), '2017_ILLINOIS', 'ILLINOIS', 2017)
(Decimal('246.514'), Decimal('287.706'), Decimal('226.418'), Decimal('266.929'), '2017_INDIANA', 'INDIANA', 2017)
(Decimal('243.107'), Decimal('286.239'), Decimal('221.747'), Decimal('272.024'), '2017_IOWA', 'IOWA', 2017)
(Decimal('241.213'), Decimal('285.284'), Decimal('223.268'), Decimal('267.676'), '2017_KANSAS', 'KANSAS', 2017)
(Decimal('239.178'), Decimal('277.714'), Decimal('224.081'), Decimal('267.49'), '2017_KENTUCKY', 'KENTUCKY', 2017)
(Decimal('228.972'), Decimal('266.507'), Decimal('211.601'), Decimal('265.133'), '2017_LOUISIANA', 'LOUISIANA', 2017)
(Decimal('239.899'), Decimal('284.003'), Decimal('221.389'), Decimal('256.751'), '2017_MAINE', 'MAINE', 2017)
(Decimal('240.601'), Decimal('280.91'), Decimal('225.049'), Decimal('268.931'), '2017_MARYLAND', 'MARYLAND', 2017)
(Decimal('249.103'), Decimal('297.042'), Decimal('235.7'), Decimal('267.251'), '2017_MASSACHUSETTS', 'MASSACHUSETTS', 2017)
(Decimal('235.555'), Decimal('279.505'), Decimal('217.753'), Decimal('277.783'), '2017_MICHIGAN', 'MICHIGAN', 2017)
(Decimal('248.804'), Decimal('293.962'), Decimal('224.539'), Decimal('265.469'), '2017_MINNESOTA', 'MINNESOTA', 2017)
(Decimal('234.694'), Decimal('270.915'), Decimal('215.203'), Decimal('268.617'), '2017_MISSISSIPPI', 'MISSISSIPPI', 2017)
(Decimal('239.502'), Decimal('280.596'), Decimal('222.681'), Decimal('256.345'), '2017_MISSOURI', 'MISSOURI', 2017)
(Decimal('240.722'), Decimal('285.6'), Decimal('222.327'), Decimal('266.035'), '2017_MONTANA', 'MONTANA', 2017)
(Decimal('245.591'), Decimal('288.406'), Decimal('224.096'), Decimal('267.208'), '2017_NEBRASKA', 'NEBRASKA', 2017)
(Decimal('231.685'), Decimal('275.365'), Decimal('214.842'), Decimal('268.529'), '2017_NEVADA', 'NEVADA', 2017)
(Decimal('245.32'), Decimal('293.291'), Decimal('228.901'), Decimal('259.806'), '2017_NEW_HAMPSHIRE', 'NEW_HAMPSHIRE', 2017)
(Decimal('247.855'), Decimal('291.699'), Decimal('232.943'), Decimal('274.786'), '2017_NEW_JERSEY', 'NEW_JERSEY', 2017)
(Decimal('229.704'), Decimal('269.374'), Decimal('207.704'), Decimal('275.045'), '2017_NEW_MEXICO', 'NEW_MEXICO', 2017)
(Decimal('235.548'), Decimal('281.688'), Decimal('221.884'), Decimal('255.579'), '2017_NEW_YORK', 'NEW_YORK', 2017)
(Decimal('240.951'), Decimal('281.926'), Decimal('223.931'), Decimal('264.158'), '2017_NORTH_CAROLINA', 'NORTH_CAROLINA', 2017)
(Decimal('244.244'), Decimal('288.172'), Decimal('221.519'), Decimal('262.72'), '2017_NORTH_DAKOTA', 'NORTH_DAKOTA', 2017)
(Decimal('240.928'), Decimal('287.714'), Decimal('225.261'), Decimal('265.082'), '2017_OHIO', 'OHIO', 2017)
(Decimal('237.326'), Decimal('274.689'), Decimal('216.588'), Decimal('268.451'), '2017_OKLAHOMA', 'OKLAHOMA', 2017)
(Decimal('233.132'), Decimal('282.173'), Decimal('217.531'), Decimal('261.237'), '2017_OREGON', 'OREGON', 2017)
(Decimal('241.672'), Decimal('286.394'), Decimal('224.925'), Decimal('266.217'), '2017_PENNSYLVANIA', 'PENNSYLVANIA', 2017)
(Decimal('237.555'), Decimal('277.18'), Decimal('223.353'), Decimal('269.554'), '2017_RHODE_ISLAND', 'RHODE_ISLAND', 2017)
(Decimal('234.044'), Decimal('274.674'), Decimal('213.128'), Decimal('265.768'), '2017_SOUTH_CAROLINA', 'SOUTH_CAROLINA', 2017)
(Decimal('241.589'), Decimal('286.376'), Decimal('221.75'), Decimal('259.753'), '2017_SOUTH_DAKOTA', 'SOUTH_DAKOTA', 2017)
(Decimal('236.693'), Decimal('278.778'), Decimal('218.953'), Decimal('267.356'), '2017_TENNESSEE', 'TENNESSEE', 2017)
(Decimal('240.944'), Decimal('282.32'), Decimal('214.878'), Decimal('262.047'), '2017_TEXAS', 'TEXAS', 2017)
(Decimal('242.481'), Decimal('286.817'), Decimal('225.159'), Decimal('260.343'), '2017_UTAH', 'UTAH', 2017)
(Decimal('240.893'), Decimal('287.623'), Decimal('226.445'), Decimal('268.752'), '2017_VERMONT', 'VERMONT', 2017)
(Decimal('248.041'), Decimal('290.081'), Decimal('227.598'), Decimal('273.403'), '2017_VIRGINIA', 'VIRGINIA', 2017)
(Decimal('241.701'), Decimal('289.131'), Decimal('223.123'), Decimal('267.745'), '2017_WASHINGTON', 'WASHINGTON', 2017)
(Decimal('236.057'), Decimal('273.416'), Decimal('217.316'), Decimal('271.617'), '2017_WEST_VIRGINIA', 'WEST_VIRGINIA', 2017)
(Decimal('240.389'), Decimal('288.143'), Decimal('219.613'), Decimal('258.7'), '2017_WISCONSIN', 'WISCONSIN', 2017)

##### Question 3

Write a query that returns summary statistics for avg_math_4_score by state. Make sure to sort the results alphabetically by state name.

These summary statistics include count, average, min, and max values.

In [12]:
#max scores by state...
sql = '''
SELECT MAX(avg_math_4_score) as max_math_score, state
FROM naep
GROUP BY state
ORDER BY state;
'''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

(Decimal('232.861'), 'ALABAMA')
(Decimal('237.274'), 'ALASKA')
(Decimal('240.305'), 'ARIZONA')
(Decimal('239.891'), 'ARKANSAS')
(Decimal('234.165'), 'CALIFORNIA')

In [13]:
#min scores by state...
sql = '''
SELECT MIN(avg_math_4_score) as min_math_score, state
FROM naep
GROUP BY state
ORDER BY state;
'''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

(Decimal('208.328'), 'ALABAMA')
(Decimal('223.833'), 'ALASKA')
(Decimal('215.254'), 'ARIZONA')
(Decimal('210.206'), 'ARKANSAS')
(Decimal('208.399'), 'CALIFORNIA')

In [14]:
#average score by state...
sql = '''
SELECT ROUND(AVG(avg_math_4_score), 0) as avg_math_score, state
FROM naep
GROUP BY state
ORDER BY state;
'''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

(Decimal('225'), 'ALABAMA')
(Decimal('234'), 'ALASKA')
(Decimal('229'), 'ARIZONA')
(Decimal('230'), 'ARKANSAS')
(Decimal('226'), 'CALIFORNIA')

##### Question 4

You decide that for avg_math_4_score, a gap of more than 30 between max and min values is probably a bad sign.

Write a query that alters the previous query so that it returns only the summary statistics for avg_math_4_score by state with differences in max and min values that are greater than 30.

In [15]:
sql = '''
SELECT 
	MIN(avg_math_4_score) as min_math_score,
	MAX(avg_math_4_score) as max_math_score,
	MAX(avg_math_4_score) - MIN(avg_math_4_score) AS diff_math_score,
	state
FROM naep
GROUP BY state
ORDER BY diff_math_score DESC
LIMIT 5;
'''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

(Decimal('187.135'), Decimal('231.32'), Decimal('44.185'), 'DISTRICT_OF_COLUMBIA')
(Decimal('201.828'), Decimal('234.694'), Decimal('32.866'), 'MISSISSIPPI')
(Decimal('213.69'), Decimal('246.368'), Decimal('32.678'), 'FLORIDA')
(Decimal('212.884'), Decimal('244.802'), Decimal('31.918'), 'NORTH_CAROLINA')
(Decimal('204.14'), Decimal('234.282'), Decimal('30.142'), 'LOUISIANA')

##### Question 5

Write a query that returns a field called bottom_10_states that lists the states in the bottom 10 for avg_math_4_score in the year 2000.

In [16]:
sql = '''
SELECT state AS bottom_10_states
FROM naep
WHERE year = 2000
ORDER BY avg_math_4_score ASC LIMIT 10;
'''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows:
  print(row)

('DISTRICT_OF_COLUMBIA',)
('MISSISSIPPI',)
('CALIFORNIA',)
('NEW_MEXICO',)
('HAWAII',)
('ARKANSAS',)
('ALABAMA',)
('LOUISIANA',)
('ARIZONA',)
('GEORGIA',)

##### Question 6

Write a query that calculates the average avg_math_4_score rounded to the nearest 2 decimal places over all states in the year 2000.

In [17]:
sql = '''
SELECT ROUND(AVG(avg_math_4_score), 2) as avg_math_score
FROM naep
WHERE year = 2000;
'''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

(Decimal('224.80'),)

##### Question 7

Write a query that returns a field called below_average_states_y2000 that lists all states with an avg_math_4_score less than the average over all states in the year 2000.

In [18]:
sql = '''
SELECT avg_math_4_score, state AS below_average_states_y2000
FROM naep
WHERE 
    year = 2000
    AND avg_math_4_score < (
    SELECT ROUND(AVG(avg_math_4_score), 2) as avg_math_score
    FROM naep
    WHERE year = 2000
)
ORDER BY avg_math_4_score;
'''

# print some results just to see what we got
for row in rows:
  print(row)

(Decimal('224.80'),)

##### Question 8

Write a query that returns a field called scores_missing_y2000 that lists any states with missing values in the avg_math_4_score column of the naep data table for the year 2000.

In [19]:
sql = '''
SELECT * , state AS scores_missing_y2000
FROM naep
WHERE 
	avg_math_4_score IS NULL
	AND year = 2000;
'''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

(None, None, None, Decimal('264.303'), '2000_ALASKA', 'ALASKA', 2000, 'ALASKA')
(None, None, None, Decimal('259.564'), '2000_COLORADO', 'COLORADO', 2000, 'COLORADO')
(None, None, Decimal('224.304'), Decimal('267.001'), '2000_DELAWARE', 'DELAWARE', 2000, 'DELAWARE')
(None, None, Decimal('214.405'), None, '2000_FLORIDA', 'FLORIDA', 2000, 'FLORIDA')
(None, None, None, Decimal('263.345'), '2000_NEW_HAMPSHIRE', 'NEW_HAMPSHIRE', 2000, 'NEW_HAMPSHIRE')

##### Question 9

Write a query that returns for the year 2000 the state, avg_math_4_score, and total_expenditure from the naep table left outer joined with the finance table, using id as the key and ordered by total_expenditure greatest to least. Be sure to round avg_math_4_score to the nearest 2 decimal places, and then filter out NULL avg_math_4_scores in order to see any correlation more clearly.

In [20]:
sql = '''
SELECT naep.state, avg_math_4_score, total_expenditure
FROM naep LEFT OUTER JOIN finance
ON naep.id = finance.id
WHERE naep.year = 2000
ORDER BY total_expenditure ASC;
'''

results = engine.execute(sql)
engine.dispose()
rows = results.fetchall()

# print some results just to see what we got
for row in rows[:5]:
  print(row)

('WYOMING', Decimal('229.252'), 769923)
('NORTH_DAKOTA', Decimal('230.893'), 802768)
('DISTRICT_OF_COLUMBIA', Decimal('193.29'), 858807)
('SOUTH_DAKOTA', None, 898609)
('DELAWARE', None, 1040480)